{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<bos>"
    },
    {
      "id": 1,
      "content": "<pad>"
    },
    {
      "id": 2,
      "content": "<eos>"
    },
    {
      "id": 3,
      "content": "<unk>"
    }
  ],
  "model": {
    "type": "BPE",
    "vocab": {
      "<bos>": 0,
      "<pad>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "o": 4,
      "f": 5,
      "l": 6,
      "i": 7,
      "n": 8,
      "e": 9,
      "p": 10,
      "a": 11,
      "t": 12,
      "h": 13,
      "of": 14,
      "off": 15,
      "li": 16,
      "lin": 17,
      "line": 18,
      "pa": 19,
      "pat": 20,
      "path": 21,
      "offline": 22
    },
    "merges": [
      "o f",
      "of f",
      "l i",
      "li n",
      "lin e",
      "p a",
      "pa t",
      "pat h",
      "off line"
    ],
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "unk_token": "<unk>"
  },
  "normalizer": {
    "type": "Lowercase"
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  }
}
